// Будем учиться взаимодействовать с пользователем
//Пользователь это человек который в браузере тыкает наш сайт поэтому он по-сути тыкает "кнопки" или вводит данные в поля
//а мы должны эти данные получать и что-то с ними делать
//Поэтому тут мы будем учиться взаимодействовать даже не с пользователем, а скорее со страницей как таковой, в том числе извлекая 
//данные от пользователя.

// в браузере самый главный это объект window. В нем хранится вообще все о странице и пользователе, даже такие данные как геолокация
// пользователя, все в window. Это называется глобальный объект, и благодаря тому что он глобальный - нам не обязательно его указывать
// Например, когда мы используем setTimeout это поидее window.setTimeout
 window.setTimeout(()=> console.log('hi'), 3000);
setTimeout(()=> console.log('hi without window'), 3000);

//Чтобы взаимодействовать с элементами на странице мы будем взаимодействовать с дочерним объектом document (window.document)
//Вот несколько вариантов получения элементов 
let a  = document.getElementById('test');
let b = document.getElementsByClassName('testClass')
//console.log(a)
//console.log(b)


let c = document.querySelector('#test')
let d = document.querySelector('.testClass')
//console.log(c)
//console.log(d)
// ------------------------------------------------------------------------------------------------------------------------
//  Поиск элементов (Подробнее)
// Есть несколько разных но довольно похожих методов поиска (получения доступа) к элементам
// ------------------------------------------------------------------------------------------------------------------------
// getElementById - поиск элемента по id - самый простой способ получить элемент - дать ему в html id и по нему обратиться из js
let byId  = document.getElementById('button'); // По айдишнику  

console.dir(byId) 
//Если вывести кнопку не через консоль лог а дир то покажутся в консоли все что
//  касается этой кнопки (ну или другого элемента) !!
// ------------------------------------------------------------------------------------------------------------------------
// getElementsByClassName - получение группы элементов по классу ()
// в отличии от предыдущего мы ищем по классу. Проблема в том, что id должен быть уникален для каждого элемента, но иногда нам
//нужно найти много элементов. Для этого мы даем всем им одинаковый класс, и тогда можем сразу взять их все через getElementsByClassName
let byClass = document.getElementsByClassName('paragraph'); //сохранит в виде массива все элементы в переменную byClass
let ss = document.getElementsByTagName('div') // Та же борода только ищем по тегу, и есть для единичного выбора getElementByTagName
console.dir(byClass) 
// ------------------------------------------------------------------------------------------------------------------------
// Есть более универсальный способ через querySelector и querySelectorAll 
// единый способ для поиска либо одного, либо нескольких элементов.
// Если мы хотим найти по id = используем "#id" ", если по классу то точку ".class" если без ничего - будет искать по тегу "tag"

let qsElement = document.querySelector('#button')
let qsElements = document.querySelectorAll('.paragraph')
let qsElementByTag = document.querySelector('p')
let qsElementsByTag = document.querySelectorAll('p')

// --- Теперь когда мы получили доступ к элементам мы можем с ними взаимодействовать
// --- но перед этим надо упомянуть непрямые способы доступа, а именно то что получив доступ к элементу способом выше 
// --- мы можем получать доступ: к его детям, родителям, соседям, последнему ребенку и первому. Это может понадобиться 
// --- если у нас нет возможности узнать какой элемент будет рядом, какой у него класс или тег
// --- Вообще мы можем как в css указать селектор по типу "div > ul" но сейчас про другое
// ------------------------------------------------------------------------------------------------------------------------
// -Поиск детей
let div = document.querySelector('#test')
// ------------------------------------------------------------------------------------------------------------------------
console.log(div.firstElementChild) //Вернет первый дочерний элемент
console.log(div.lastElementChild) //Вернет последний дочерний элемент
console.log(div.children)        //Вернет все дочерние элементы
// ------------------------------------------------------------------------------------------------------------------------
// -Поиск родителя и соседей
// ------------------------------------------------------------------------------------------------------------------------
console.log(`ParentNode: ${div.parentNode}`)        //Родители
console.log(`ParentNode: ${div.parentElement}`)      //Родители   
let p = document.querySelector('.testP')
console.log(`Соседние элементы (братья XD): ${p.nextElementSibling}`)      //Следующий сосед   
console.log(`Соседние элементы (братья XD): ${p.previousElementSibling}`)  //Предыдуший сосед   
// ------------------------------------------------------------------------------------------------------------------------
// -Пример использования
// ------------------------------------------------------------------------------------------------------------------------
    for(let i= 0; i < div.children.length; i++){
        let el = div.children[i];
        if(el.tagName === 'BUTTON'){ 
            console.log('Have buttons')
        } else {
            console.log(el.tagName)
        }
    }
// ------------------------------------------------------------------------------------------------------------------------
// Момент: tagName нужно писать капсом, т.к. в браузере оно тоже капсом. Если использовать маленькие буквы то ничего не найдется!
// ------------------------------------------------------------------------------------------------------------------------

// ------------------------------------------------------------------------------------------------------------------------ 
console.log(div.firstChild) //Важно помнить что эта штука в отличии от firstElementChild вернет первое дочернее что угодно
                            // даже если это просто текст, пустая строка, или например html-комментарий <-- comment -->
                            // наверняка это для чего-то нужно но нам пока нужно использовать именно то что отдаст теги
// ========================================================================================================================

// Изменение содержимого в полученных элементах
// Теперь, когда мы научились получать доступ - мы можем менять эти элементы. База это изменение содержимого, либо текстового
// либо даже html. Для этого у нас есть два свойства:  elem.textContent и elem.innerHTML 
let test = document.querySelector('.testChanges');
setTimeout(() => {
    test.textContent = 'Hello World';
}, 2000);
setTimeout(() => {
    test.innerHTML = `<b>InnerHTML</b>`;
}, 4000);

// ========================================================================================================================

