// ========================================================================================================================
// Решил переименовать файлы с последних уроков чтобы было понятнее что работаем с DOM т.к. user не особо раскрывает суть.
// ========================================================================================================================
// Теперь мы будем работать не только с html через js, но и с css =)
// Так-же мы научимся искать по другим атрибутам элементы
// ========================================================================================================================

const checkbox = document.querySelector('[name="my-checkbox"]') //Вот так ищем по аттрибуту name наш чекбокс
// ========================================================================================================================
// В первую очередь поработаем с аттрибутами. Для этого у нас есть
// setAttribute - установить аттрибут
// hasAttribute - проверить наличие аттрибута
// getAttribute - получить аттрибут
// removeAttribute - удалить аттрибут
// ========================================================================================================================
console.log(checkbox.getAttribute('type')) // checkbox
console.log(checkbox.getAttribute('name')) // my-checkbox
console.log(checkbox.getAttribute('checked')) // выводит пустую строку, для наглядности лучше проверять наличие: 
console.log(checkbox.hasAttribute('checked')) // Тогда в консоли явно будет true


// Хоть мы и рассматриваем на чекбоксе, на самом деле мы можем получить значение любого аттрибута у любого элемента: 
const myLink = document.querySelector('.testLink');
console.log(myLink.getAttribute('href')) //  в консоли будет - https://google.com
// ========================================================================================================================
// Раз мы можем получить аттрибут, значит и установить его новое значение тоже, поэтому пусть наша ссылка на гугл теперь ведет
// в другое место, например на википедию:
myLink.setAttribute('target', '_blank') ; // чтобы открывалось в новом окне

const linkChanger = () => {
    myLink.setAttribute('href', 'https://ru.wikipedia.org/');
    myLink.textContent = 'Вики';
}
setTimeout(linkChanger, 3000);
// ========================================================================================================================
// Проверка аттрибута. Иногда нам в зависимости от того, есть ли аттрибут нужнно что-то сделать с элементом
// hasAttribute - возвращает true/false

myLink.hasAttribute('href') ? console.log('Ссылка есть') : console.log('Ссылка отсутствует'); // Например вот так
// Ну или если аттрибута нет - мы его можем назначить, например. 
// ========================================================================================================================
// Ну и удалить аттрибут мы конечно же можем:
const remHandler = () => myLink.hasAttribute('href') ? myLink.removeAttribute('href') : console.log('Нечего удалять'); // 
setTimeout(remHandler, 10000) // через 10 секунд если не успел нажать на ссылку гугла или вики - останешься с носом)) 

// ========================================================================================================================
// Кроме установки стандартных аттрибутов через js мы можем установить свои собственные, т.е. выдумать аттрибут и придумать 
// его поведение, например которое будет на чекбокс устанавливать время нажатия на него или еще чего. Зависит от того что надо
// Но для этого есть правило - кастомные аттрибуты должны начинаться с data-my_custom_attribute. Т.е. "data-" указывает что
// это наш собственный кастомный аттрибут для наших потребностей. Так-же мы можем получить все кастомные аттрибуты у элемента:
myLink.setAttribute('data-test_attr', 'test-value');
myLink.setAttribute('data-test_attr1', 'another-test-value');
console.log(myLink.dataset) // Выдаст следующее: DOMStringMap {test_attr: 'test-value', test_attr1: 'another-test-value'} test_attr: "test-value"test_attr1: "another-test-value"[[Prototype]]: DOMStringMap
// ========================================================================================================================
// ========================================================================================================================
// ========================================================================================================================
// Переходим к CSS: 
const a = document.querySelector('.testLink1');
const a1 = document.querySelector('.testLink2');
a.style.color = 'green'; // Вот так для свойств из одного слова
a.style.margin = '10px'; // Вот так для свойств из одного слова
a.style.backgroundColor = 'lightgrey'; // Вот так для свойств из двух слов
a.style['border-radius'] = '20%'; // Или вот так для свойств из двух слов, но сложнее чем предыдущий
a.style.border = '1px solid black'; //Вот так для свойств из одного слова
// Если же мы сразу знаем что нам нужно много разных стилей накинуть, то есть свойство cssText:
a1.style.cssText = ` color: white; 
padding: 5px 50px 5px 50px;
margin: 10px;
background-color: black;
text-decoration: none;
`
// Тут уже нам без разницы из одного или же нескольких слов задается свойство, можем просто писать обычный css
// ========================================================================================================================
// Так-же мы можем, и на самом деле в практике это очень часто делают, добавлять или удалять классы
//  className - позвляет назначить класс, зачастую юзаем для новосозданных html элементов
// Для добавления или удаления нового класса лучше использовать classList (дает доступ к массиву классов)
console.log(`classList: ${a1.classList}`)
//------------------------------------------
// classList (add, remove, toggle, contains)
a1.classList.add('someClass') // Сделает текст большим  (мы это указали в dom3.css)
a1.classList.remove('testLink2') // Удаляем класс по которому нашли элемент, LOL XD
console.log(`Before toggle ${a1.classList.contains('testLink2')}`) // Проверяем наличие класса (тоже часто нужно): false (мы его удалили строчкой выше)
a1.classList.toggle('testLink2') // Если класс есть - удаляет его, если нет - добавляет (по-сути как переключатель)
console.log(`After toggle ${a1.classList.contains('testLink2')}`) // Проверяем наличие класса снова: true
//-----------------------------------------
// Ну и естественно, если сильно надо - мы можем менять классы через setAttribute, т.к. класс это такой же аттрибут