console.dir("Уроки 1-2");
// const let var - ключевые слова для создания переменных. Используем только const, в крайнем случае let если это необходимо (выучить различия между ними!!)   
//
// 7 простых типов 
// 1. string - строки. Можно использовать разные кавычки, если использовать обратные то можно динамические данные вносить, типа `Какая-то строка ${переменная}`
// 2. number - числа. Целые и дробные (1 или 1.2 например). NaN - значение которое означает "не число", но при этом тип у него number XD. Суть в том что 
// NaN выдаст функция которая принимает или возвращает числа, если ей скормить другое значение, например умножить булеан на строку наверное вернет NaN
// Есть еще Infinity - эт бесконечность, и она как и другие числа может быть как положительная так и отрицательная.
//
// 3. boolean (true/false) (yes/no)? 
//
// 4. null - пустое значение
// 5. unefined - неопределенное значение
// ..... И два типа которыми пока мало будем пользоваться
// 6. Symbol для создания уникальных ключей в объектах
// 7. BigInt для супер-больших чисел хз
//

/// Typeof
// Оператор который помогает проверять тип, но  есть пара нюансов
// Оператор typeof возвращает строку с названием типа, поэтому если написать этот оператор дважды - он вернет строку для любых значений, просто интересный факт
// ну и из других интересных фактов - есть путаница с null, хоть это отдельный тип данных, но typeof для него вернет object

//typeof undefined = undefined
//typeof null = object
//typeof typeof null = string
//typeof typeof number = string
//typeof typeof boolean = string итд.
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//
//
//
