console.dir('Array - массивы урок 3')
// Массивы это структура данных в которой хранится много элементов. Выглядит примерно так:
const array = [1, 2, 3, 4];
const array1 = ['hello', 5, true, [1,2,3,5]];
//Данные могут быть однотипные или неоднотипные. К каждому элементу массива можно получить доступ по интексу
//индексация в массивах начинается с 0, поэтому чтобы обратиться к первому элементу массива нужно использовать array[0]
//а чтобы обратиться к последнему - array[array.length - 1]


//К длине массива можно обратиться двумя способами: 
console.log(array.length); // Предпочтительнее
console.log(array['length']);
//Это поведение довольно интересное, т.к. мы так-же можем делать разные интересные штуки таким образом, например добавлять массиву несуществующие поля
//и потом к ним обращаться
//Так-же мы можем вызывать методы массива таким образом :
array['push']('test'); 
console.log(array)
// Так же стоит обратить внимание на то, что массив это вариант объекта, а индекс это по факту ключ объекта, 
// поэтому когда мы запрашиваем array[0] это автоматически преобразуется в array["0"]. 
//
//Кроме всего прочего, мы можем назначать под конкретный индекс значение массива. Например, у нас есть массив из двух элементов
// а мы зачем-то хотим добавить в него элемент который будет не третьим в массиве а десятым, например:
array[10] = 'Test data'
console.log(array)
console.log(array.length) //теперь равен 11
// Таким образом мы на конкретное место поставили нужный нам элемент, а js автоматически создал несколько пустих элементов массива
console.log(array[7]) //undefined - т.к. значения никакого на этом индексе нет
// Так-же мы можем в массиве создать буквенный индекс, и в него поместить какое-то значение, однаком если мы так сделаем - длина массива не изменится
// это редко используется но полезно знать о таком поведении
typeof array; // object 
console.log('Array is Array: ', Array.isArray(array)) //true
// Но если очень надо - у массива есть специальный метод для проверки массив ли это или нет - Array.isArray(array) - на случай когда нам точно надо знать
//что массив это массив, он вернет либо true либо false



//Итоги:
const text = `Массив это структура данных в которой в отличии от объекта значения хранятся не по ключам а по числовым индексам, которые начинаются с нуля
 Если мы хотим из массива достать элемент то обращаемся к нему по индексу. В массиве можно хранить все что угодно, в том числе объекты и другие массивы.
 У массива как у структуры есть множество методов для взаимодействия с ним, таких как сортировка, поиск элемента по индексу и наоборот, 
 добавление и удаление элементов и т.д.`
