console.log('Objects')
// Из прошлого урока по массивам мы помним, что ключи в объектах это строки, и учитывая что это всегда строки 
// необязательно заключать их в кавычки, однако, если мы хотим сделать составной ключ - в этом случае уже нужно взять в кавычки ключ
const obj1 = {
    key1: 'hello',
    key2: 5,
    key3: true,
    "test key": "test"
}
console.log(obj1["test key"]) // если ключь составной то и обрашаться к нему нужно специальным способом
console.log(obj1.key1) 

// Чтобы обратиться к какому-то полю объекта мы можем обращаться либо через точку, либо как в случае с массивами через квадратные скобки
const obj2 = {
    money: {
        sum: 500,
        currency: 'usd',

    },
    items: [{
        title: 'Книга', 
        count: 1,
        price: 20
    },
    {
        title: 'Карандаш',
        count: 10,
        price: 1
    }]
}
console.log(obj2.items[0].title)
console.log(obj2["items"][0]["title"]) //Эти две записи равнозначны но первая куда проще для чтения и понимания.
// Просто через точку обращаемся к нужному полю и так спускаемся вглубь объекта, если одно из полей - массив, то и к элементам его
//обращаемся как к элементам массива через индекс. 
//В большинстве случаев будет использоваться первый способ, но и второй тоже используется, если ключь находится в переменной то точно только через скобки

// Разницы в результате нет — оба способа дают доступ к одному и тому же свойству.
// Но obj["key"] позволяет использовать динамические ключи и ключи с недопустимыми для точки символами, а obj.key — только для статических и валидных имен.
 
// Оператор In позволяет проверить есть ли в объекте данный ключ
console.log("money" in obj2)